#include "StdAfx.h"
#include "BER_Output.h"

//==============================================================
//		コンストラクタ
//--------------------------------------------------------------
//	●引数
//				無し
//	●返値
//				無し
//==============================================================
BER_Output::BER_Output(const char*	strFileName):
	FileOutput(strFileName)
{
}
//==============================================================
//		デストラクタ
//--------------------------------------------------------------
//	●引数
//				無し
//	●返値
//				無し
//==============================================================
BER_Output::~BER_Output(void)
{
}
//==============================================================
//				ファイルへ
//--------------------------------------------------------------
//	●引数
//		const		char*	strCode		BERエンコードしたバイナリのポインタ
//		unsigned	int		szCode		BERエンコードしたバイナリのサイズ
//	●返値
//			無し
//	●注意
//			外部データの後ろにもBERエンコードされたデータがあるとダメ。
//==============================================================
void	BER_Output::write_BERcode(const	char* strCode, size_t szCode)
{
	write(strCode, szCode);
}