#include "StdAfx.h"
#include "AlgorithmIdentifier.h"

//==============================================================
//		コンストラクタ
//--------------------------------------------------------------
//	●引数
//				無し
//	●返値
//				無し
//==============================================================
AlgorithmIdentifier::AlgorithmIdentifier(const char _strName[]):
	Sequence(_strName)
{
}

//==============================================================
//		デストラクタ
//--------------------------------------------------------------
//	●引数
//				無し
//	●返値
//				無し
//==============================================================
AlgorithmIdentifier::~AlgorithmIdentifier(void)
{
}
//==============================================================
//		値を設定
//--------------------------------------------------------------
//	●引数
//			ASN1* asn1		memberとなるobject
//	●返値
//			無し
//==============================================================
void	AlgorithmIdentifier::Set(unsigned int i[],unsigned int n)
{
	//------
	//contentType ContentType
	algorithm.Set(i,n);
	Set_Construct(&algorithm);
}
