#pragma once
#include "SHA-256.h"

/****************************************************************/
/*			定数定義											*/
/****************************************************************/
#define	SHA224_HashSizeB	224
#define	SHA224_HashSize		(SHA224_HashSizeB/8)

/****************************************************************/
/*			クラス定義											*/
/****************************************************************/
class SHA224 :
	public SHA256
{
public:
	SHA224(void);
	~SHA224(void);

	void	init(void);
	void	getHash(void *result);
};
