#pragma once
#include "sha.h"

//======================================================================
//					SHA-1
//----------------------------------------------------------------------
//  Reference:
//	RFC 3174		US Secure Hash Algorithm 1 (SHA1)
//	RFC 3370		Cryptographic Message Syntax (CMS) Algorithms
//======================================================================
//
//	本プログラムは、SHA-1ハッシュを算出するクラスです。
//
//						Copyright (c) A.Watanabe (2011)
//
//----------------------------------------------------------------------
//	Revision:
//		2011. 1.17	初版
//		2011. 4.21	ハッシュ値が4Byte単位で上位・下位バイトが反転していたバグを修正。
//======================================================================
/****************************************************************/
/*			定数定義											*/
/****************************************************************/


/****************************************************************/
/*			定数定義											*/
/****************************************************************/
#define	SHA1_HashSizeB	160
#define	SHA1_HashSize	(SHA1_HashSizeB/8)

/****************************************************************/
/*			クラス定義											*/
/****************************************************************/
class SHA1 :
	public SHA
{
public:
	static	unsigned	int		oid[];
			unsigned	int		H[5];				//ハッシュ値

	SHA1(const char _strName[]="SHA-1");
	~SHA1(void);

	void	Set_SHA1(void);		//ASN.1用の構造体作成

	void	init(void);
	void	calc(void *data);
	void	getHash(void *result);
};
