#pragma once
#include "SHA-256.h"

//======================================================================
//					SHA-224
//----------------------------------------------------------------------
//  Reference:
//	RFC 3874		A 224-bit One-way Hash Function: SHA-224
//	RFC 4634		US Secure Hash Algorithms (SHA and HMAC-SHA)
//	RFC 5754		Using SHA2 Algorithms with Cryptographic Message Syntax
//======================================================================
//
//	本プログラムは、SHA-224ハッシュを算出するクラスです。
//
//						Copyright (c) A.Watanabe (2011)
//
//----------------------------------------------------------------------
//	Revision
//		2011. 1.17	初版
//		2011. 4.21	ハッシュ値が4Byte単位で上位・下位バイトが反転していたバグを修正。
//======================================================================
/****************************************************************/
/*			定数定義											*/
/****************************************************************/


/****************************************************************/
/*			定数定義											*/
/****************************************************************/
#define	SHA224_HashSizeB	224
#define	SHA224_HashSize		(SHA224_HashSizeB/8)

/****************************************************************/
/*			クラス定義											*/
/****************************************************************/
class SHA224 :
	public SHA256
{
public:
	static	unsigned	int		oid[];

	SHA224(const char _strName[]="SHA-224");
	~SHA224(void);

	void	Set_SHA224(void);		//ASN.1用の構造体作成

	void	init(void);
	void	getHash(void *result);
};
