#pragma once
#include "Digest.h"

//======================================================================
//	FIPS Pub 180-3	Secure Hash Standard (SHS)
//======================================================================
//
//	本プログラムは、ＳＨＡハッシュを算出するための基底クラスです。
//
//						Copyright (c) A.Watanabe (2011)
//
//----------------------------------------------------------------------
//	Revision
//		2011. 1.17	初版
//======================================================================
/****************************************************************/
/*			計算式定義											*/
/****************************************************************/
#define ROTL(n,x)		((x<<n) | (x>>((sizeof(x)*8)-n)))
#define ROTR(n,x)		((x>>n) | (x<<((sizeof(x)*8)-n)))
#define SHR(n,x)		(x>>n)

#define	_mm_ROTLD(n,x)	_mm_or_si128(_mm_slli_epi32(x,n),_mm_srli_epi32(x,32-n))
#define	_mm_ROTRD(n,x)	_mm_or_si128(_mm_srli_epi32(x,n),_mm_slli_epi32(x,32-n))
#define	_mm_SHRD(n,x)	_mm_srli_epi32(x,n)

#define	Ch(x,y,z)		((x & y) ^ ((~x) & z))
#define	Parity(x,y,z)	(x ^ y ^ z)
#define	Maj(x,y,z)		((x & y) ^ (x & z) ^ (y & z))

/****************************************************************/
/*			定数定義											*/
/****************************************************************/
#define	SHA_BlockSize	64
#define	SHA_BlockSizeB	SHA_BlockSize * 8

/****************************************************************/
/*			クラス定義											*/
/****************************************************************/
class SHA :
	public Digest
{
public:
//	ASN1	null;

	SHA(const char _strName[]="SHA-256");
	~SHA(void);
};
