#include "StdAfx.h"
#include "ContentInfo.h"

//==============================================================
//		コンストラクタ
//--------------------------------------------------------------
//	●引数
//				無し
//	●返値
//				無し
//==============================================================
ContentInfo::ContentInfo(const char _strName[]):
	Sequence(_strName),
	context(0)
{
}
//==============================================================
//		デストラクタ
//--------------------------------------------------------------
//	●引数
//				無し
//	●返値
//				無し
//==============================================================
ContentInfo::~ContentInfo(void)
{
}
//==============================================================
//		値を設定
//--------------------------------------------------------------
//	●引数
//		unsigned int i[]	oid値	
//		unsigned int n		oidのサイズ
//	●返値
//			無し
//==============================================================
void	ContentInfo::Set(unsigned int i[],unsigned int n)
{
	//------
	//contentType ContentType
	contentType.Set(i,n);
	Set_Construct(&contentType);

	//------
	//content [0] EXPLICIT ANY DEFINED BY contentType
	Set_Construct(&context);
}
